Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: The first is to set up accounts for everybody, which is straightforward but can be cumbersome.
cs: Prvním způsobem je nastavit účty pro všechny, což je sice přímočaré, ale může to být poněkud zdlouhavé.

source: The first line also has a list of the server’s capabilities (here, `report-status` and `delete-refs`).
cs: První řádek uvádí rovněž seznam schopností serveru (zde `report-status` a `delete-refs`).

source: The first line also has the client’s capabilities.
cs: První řádek navíc popisuje schopnosti klienta.

source: The first line tells Git to ignore any files ending in `.o` or `.a` — _object_ and _archive_ files that may be the product of building your code.
cs: První řádek říká systému Git, že má ignorovat všechny soubory končící na `.o` nebo `.a` – _objekty_ a _archivní_ soubory, které mohou být výsledkem překladu.

source: The first line was printed out by you, the other two were Git telling you that the update script exited non-zero and that is what is declining your push.
cs: První řádek jste vytvořili vy, dalšími dvěma řádky vám Git sděluje, že je výstup skriptu update nenulový, a proto bude odeslání odmítnuto.

source: The first parent is the branch you were on when you merged, and the second is the commit on the branch that you merged in:
cs: První rodič je větev, na níž jste se během začlenění nacházeli, druhým rodičem je větev, kterou jste začleňovali:

source: The first place Git looks for these values is in an `/etc/gitconfig` file, which contains values for every user on the system and all of their repositories.
cs: Prvním místem, kde Git tyto hodnoty vyhledává, je soubor `/etc/gitconfig`, obsahující hodnoty pro každého uživatele v systému a všechny jejich repozitáře.

source: The first problem is the author information.
cs: Prvním problémem jsou informace o autorovi.

source: The first script to run when handling a push from a client is `pre-receive`.
cs: Prvním skriptem, který se při manipulaci s revizemi přijatými od klienta spustí, je `pre-receive`.

source: The first section of this chapter will cover the available protocols and the pros and cons of each.
cs: První část této kapitoly se bude věnovat možným protokolům, jejich přednostem a nevýhodám.

source: The first takes an existing project or directory and imports it into Git.
cs: První způsob spočívá v tom, že vezmeme existující projekt nebo adresář a importujeme ho do systému Git.

source: The first thing this command does is pull down the `info/refs` file.
cs: První věcí, kterou příkaz udělá, je stažení souboru `info/refs`.

source: The first thing you need to do is set up a free user account.
cs: První věcí, kterou budete muset udělat, je vytvoření bezplatného uživatelské účtu.

source: The first thing you should do is clone the external repository into your subdirectory.
cs: První věcí, kterou byste měli udělat, je naklonovat externí repozitář do vlastního podadresáře.

source: The first thing you should do when you install Git is to set your user name and e-mail address.
cs: První věcí, kterou byste měli po nainstalování systému Git udělat, je nastavení vašeho uživatelského jména (user name) a e-mailové adresy.

source: The first thing you’ll do is write your ACL.
cs: Prvním krokem, který budete muset udělat, je vytvoření seznamu ACL.

source: The first variable is active contributor size.
cs: První proměnnou je počet aktivních přispěvatelů.

source: The following command is equivalent:
cs: Následující příkaz je ekvivalentní:

source: The format consists of the word data, the size of the data to be read, a newline, and finally the data.
cs: Tento formát tedy obsahuje slovo data, velikost načítaných dat (size), nový řádek a konečně data samotná (contents).

source: The format for a commit object is simple: it specifies the top-level tree for the snapshot of the project at that point; the author/committer information pulled from your `user.name` and `user.email` configuration settings, with the current timestamp; a blank line, and then the commit message.
cs: Formát objektu revize je prostý. Udává strom nejvyšší úrovně pro snímek projektu v tomto místě; informace o autorovi řešení/autorovi změny revize získané z konfiguračního nastavení `user.name` a `user.email`, spolu s aktuálním časovým údajem; poté následuje prázdný řádek a za ním zpráva k revizi.

source: The format for listing the new file contents or specifying a modified file with the new contents is as follows:
cs: Formát pro výpis obsahu nového souboru nebo určení změněného souboru s novým obsahem je následující:

source: The format of the refspec is an optional `+`, followed by `<src>:<dst>`, where `<src>` is the pattern for references on the remote side and `<dst>` is where those references will be written locally.
cs: Refspec má následující formát: fakultativní znak `+`, za nímž následuje `<src>:<dst>`, kde `<src>` je vzor pro referenci na straně vzdáleného serveru a `<dst>` je lokální umístění, kam mají být tyto reference zapsány.

source: The general sequence is something like that shown in Figure 5-11.
cs: Obecná posloupnost kroků je naznačena na obrázku 5-11.

source: The gitk history visualizer.
cs: Graficky zpracovaná historie v nástroji „gitk“

source: The group names are just like macros; when defining them, it doesn’t even matter whether they are projects or users; that distinction is only made when you _use_ the "macro".
cs: Jména skupin se chovají jako makra; když je definujete, je úplně jedno jestli jde o projekty nebo uživatele; rozdíl se pozná až v momentu, kdy „makro“ _použijete_.

source: The hooks are all stored in the `hooks` subdirectory of the Git directory.
cs: Všechny zásuvné moduly jsou uloženy v podadresáři `hooks` adresáře Git.

source: The idea is that your branches are at various levels of stability; when they reach a more stable level, they’re merged into the branch above them.
cs: Idea je taková, že se větve nacházejí na různé úrovni stability. Jakmile dosáhnou stability o stupeň vyšší, jsou začleněny do větve nad nimi.

source: The idea of the subtree merge is that you have two projects, and one of the projects maps to a subdirectory of the other one and vice versa.
cs: Začlenění podstromu spočívá v tom, že máte dva projekty a jeden z projektů se promítá do podadresáře druhého projektu a naopak.

source: The index is a file that contains offsets into that packfile so you can quickly seek to a specific object.
cs: Index je soubor, který obsahuje ofsety do tohoto balíčkového souboru, díky nimž lze rychle vyhledat konkrétní objekt.

source: The initial format in which Git saves objects on disk is called a loose object format.
cs: Prvotní formát, v němž Git ukládá objekty na disku, se nazývá volný formát objektů (loose object format).

source: The initial information states that you’re defining a commit object and what branch it’s on, followed by the mark you’ve generated, the committer information and commit message, and then the previous commit, if any.
cs: Úvodní informace sděluje, že definujete objekt revize a na jaké větvi se nachází. Následuje vygenerovaný označovač, informace o autorovi revize a zpráva k revizi, po ní následuje eventuální předchozí revize.

source: The interactive rebase gives you a script that it’s going to run.
cs: V interaktivním režimu přeskládání se nyní spustí skript.

source: The iss53 branch has moved forward with your work.
cs: Větev iss53 se s vaší prací posouvá vpřed.

source: The issue is that you generally don’t want to work in a detached HEAD environment, because it’s easy to lose changes.
cs: Problém je, že většinou nechcete pracovat v prostředí oddělené hlavy, protože byste tak velmi snadno mohli přijít o provedené změny.

source: The issue with including the library is that it’s difficult to customize the library in any way and often more difficult to deploy it, because you need to make sure every client has that library available.
cs: Problém s použitím knihovny je ten, že je obtížné knihovnu jakýmkoli způsobem upravit a často ještě těžší ji nasadit, protože se musíte ujistit, že ji má k dispozici každý klient.

source: The issue with vendoring the code into your own project is that any custom changes you make are difficult to merge when upstream changes become available.
cs: Problémem s převzetím zdrojového kódu do vlastního projektu bývá, že jakékoli uživatelské změny, které provedete, se obtížně začleňují, pokud se objeví novější změny.

source: The last hook to run during a `git am` operation is `post-applypatch`.
cs: Posledním zásuvným modulem, který je během operace `git am` spuštěn, je `post-applypatch`.

source: The last main caveat that many people run into involves switching from subdirectories to submodules.
cs: Poslední velký problém s nímž se uživatelé často setkávají, souvisí s přepínáním z podadresářů na submoduly.

source: The last major range-selection syntax is the triple-dot syntax, which specifies all the commits that are reachable by either of two references but not by both of them.
cs: Poslední významnou syntaxí k určení intervalu je trojtečková syntaxe, která vybere všechny revize dostupné ve dvou referencích, ale ne v obou zároveň.

source: The last piece of meta-information you need for each commit is the committer data, which you hardcode in a global variable:
cs: Posledními metadaty, jež budete pro všechny revize potřebovat, jsou informace o autorovi revize, které zadáte v globální proměnné:

source: The last really useful option to pass to `git log` as a filter is a path.
cs: Posledním opravdu užitečným parametrem, který lze přidat k příkazu `git log` , je zadání cesty.

source: The last thing to do is add your new Git server as a remote and push to it.
cs: Poslední věcí, která ještě zbývá, je přidat nový server Git jako vzdálený repozitář a odeslat do něj revize.

source: The last thing to keep in mind is the commit message.
cs: Poslední věcí, na niž se vyplatí soustředit pozornost, jsou zprávy k revizím.

source: The last thing you have to do is check that you’re not trying to push non-fast-forwarded references, but that is a bit less common.
cs: Posledním krokem, který budete muset provést, je ověření, že nebudete odesílat reference nesměřující rychle vpřed. Tento krok však už není tak jednoduchý.

source: The last thing you need to do is to return the current mark so it can be passed to the next iteration:
cs: Poslední věcí, kterou musíte udělat, je vrátit aktuální označovač, aby mohl být zadán do příští iterace:

source: The latter wouldn’t be ideal, because all your code repository instances would reside on the same computer, making a catastrophic loss much more likely.
cs: Tato druhá varianta není právě ideální, protože všechny instance repozitáře s kódem jsou v takovém případě umístěny v jednom počítači, čímž se zvyšuje riziko nevratné ztráty dat.

source: The lifecycle of the status of your files.
cs: Cyklus stavů vašich souborů

source: The line should look something like this:
cs: Řádek by měl vypadat takto:

source: The lines must be formatted as follows <TAB><First column text><TAB><Second column text> -->
cs: Řádky musí být formátovány následovně <TAB><Text prvního sloupce><TAB><Text druhého sloupce> -->

source: The logic for checking this is to see if any commits are reachable from the older revision that aren’t reachable from the newer one.
cs: Kontrolu můžete provést tak, že se podíváte, zda jsou některé revize dostupné ze starších verzí, ale nejsou dostupné z novějších.

source: The main Source tab that you land on shows your project’s main directory listing and automatically renders the README file below it if you have one.
cs: Hlavní záložka „Source“, na níž se stránka otvírá, zobrazuje hlavní adresář vašeho projektu, a máte-li soubor README, automaticky pod adresářem projektu zobrazí jeho obsah.

source: The main difference is that a tag object points to a commit rather than a tree.
cs: Hlavním rozdílem je, že objekt značky ukazuje na revizi, zatímco objekt revize na strom.

source: The main difficulty with describing this process is that there are a huge number of variations on how it’s done.
cs: Popsat tento proces není právě jednoduché, protože existuje obrovské množství variací, jak lze do projektů přispívat.

source: The main drawback to this approach is that it can be very slow and is often unnecessary — if you don’t try to force the push with `-f`, the server will warn you and not accept the push.
cs: Největší nevýhodou tohoto postupu je, že může být velmi pomalý a není vždy nutný. Pokud se nesnažíte vynutit si odeslání parametrem `-f`, server vás sám upozorní a odesílané revize nepřijme.

source: The main problem with this in Git is that you can’t modify a file with information about the commit after you’ve committed, because Git checksums the file first.
cs: Hlavním problémem v systému Git je, že nelze upravit soubor s informacemi o revizi poté, co jste revizi zapsali, protože Git nejprve provede kontrolní součet souboru.

source: The main reason is speed.
cs: Mluví pro něj především rychlost.

source: The main reason to specify the `file://` prefix is if you want a clean copy of the repository with extraneous references or objects left out — generally after an import from another version-control system or something similar (see Chapter 9 for maintenance tasks).
cs: Hlavním důvodem, proč zadat předponu `file://` je to, že tak získáte čistou kopii repozitáře bez nepotřebných referencí a objektů, například po importu z jiného verzovacího systému a podobně (úkony správy jsou popsány v kapitole 9).

source: The main tool you use to determine which files are in which state is the `git status` command.
cs: Hlavním nástrojem na zjišťování stavu jednotlivých souborů je příkaz `git status`.

source: The maintainer adds the contributor’s repo as a remote and merges locally.
cs: Správce přidá repozitář přispěvatele jako vzdálený repozitář a provede lokální začlenění.

source: The maintainer of the Git project has solved this issue by including their public key as a blob in the repository and then adding a tag that points directly to that content.
cs: Správce projektu Git vyřešil tento problém tak, že přidal svůj veřejný klíč jako blob do repozitáře a poté vložil značku, která ukazuje přímo na tento obsah.

source: The maintainer of the Git project tends to namespace these branches as well — such as `sc/ruby_client`, where `sc` is short for the person who contributed the work.
cs: Správce projektů Git přiřazuje těmto větvím také jmenný prostor, např. `sc/ruby_client`, kde `sc` je zkratka pro osobu, která práci vytvořila.

source: The maintainer pushes merged changes to the main repository.
cs: Správce odešle začleněné změny do hlavního repozitáře.

source: The major difference between Git and any other VCS (Subversion and friends included) is the way Git thinks about its data.
cs: Hlavním rozdílem mezi systémem Git a všemi ostatními systémy VCS (včetně Subversion a jemu podobných) je způsob, jakým Git zpracovává data.

source: The majority of the options are client side—configuring your personal working preferences.
cs: Většina parametrů připadá na stranu klienta, neboť se jedná o konfiguraci osobního pracovního nastavení.

source: The manual page for `git config` lists all the available options in quite a bit of detail.
cs: Manuálová stránka pro `git config` zobrazí seznam všech dostupných parametrů i s celou řadou podrobností.

source: The master branch is that of the dictator.
cs: Hlavní větev je větev diktátora.

source: The mechanism that Git uses for this checksumming is called a SHA-1 hash.
cs: Mechanismus, který Git k tomuto kontrolnímu součtu používá, se nazývá otisk SHA-1 (SHA-1 hash).

source: The merge goes smoothly — John’s commit history now looks like Figure 5-5.
cs: Sloučení probíhá hladce, Johnova historie revizí teď vypadá jako na obrázku 5-5.

source: The mode is taken from normal UNIX modes but is much less flexible — these three modes are the only ones that are valid for files (blobs) in Git (although other modes are used for directories and submodules).
cs: Režim (mode) je převzat z normálních režimů UNIX, jen je podstatně méně flexibilní. Tyto tři režimy jsou jediné platné pro soubory (bloby) v systému Git (ačkoli se pro adresáře a submoduly používají ještě další režimy).

source: The most basic and powerful tool to do this is the `git log` command.
cs: Nejzákladnějším a nejmocnějším nástrojem je v tomto případě příkaz `git log`.

source: The most basic is the _Local protocol_, in which the remote repository is in another directory on disk.
cs: Nejzákladnější variantou je _lokální protokol_ (Local protocol), v němž je vzdálený repozitář uložen v jiném adresáři na disku.

source: The most common range specification is the double-dot syntax.
cs: Nejčastěji se při označení intervalu používá dvojtečková syntaxe.

source: The most interesting option is `format`, which allows you to specify your own log output format.
cs: Nejzajímavějším parametrem je pak `format`, který umožňuje definovat vlastní formát výstupu logu.

source: The most obvious is the single point of failure that the centralized server represents.
cs: Tím nejkřiklavějším je riziko kolapsu celého projektu po výpadku jediného místa — centrálního serveru.

source: The most straightforward way to specify a commit requires that it have a branch reference pointed at it.
cs: Nejčistší způsob, jak určit konkrétní revizi, vyžaduje, aby měla revize referenci větve, která na ni ukazuje.

source: The msysGit project has one of the easier installation procedures.
cs: Postup instalace projektu msysGit patří k těm nejjednodušším.

source: The name of the file in `keydir` (in the previous example, `scott.pub`) will be different for you — Gitosis takes that name from the description at the end of the public key that was imported with the `gitosis-init` script.
cs: Název souboru v adresáři `keydir` (v předchozím příkladu `scott.pub`) bude ve vašem případě jiný. Gitosis převezme tento název z popisu na konci veřejného klíče, který byl importován spolu se skriptem `gitosis-init`.

source: The negative aspect of SSH is that you can’t serve anonymous access of your repository over it.
cs: Nevýhodou protokolu SSH je, že neumožňuje anonymní přístup do repozitáře.

source: The next chapter will cover the raw internals of Git so you can craft every single byte, if need be.
cs: V následující kapitole se podíváme na elementární principy systému Git, abyste dokázali efektivně využívat každý jeho byte.

source: The next chapter will go over branches and references in detail.
cs: Větve a reference budou podrobně popsány v následující kapitole.

source: The next hook to run when applying patches via `git am` is `pre-applypatch`.
cs: Další zásuvným modulem, který se může spouštět při aplikaci záplaty příkazem `git am`, je `pre-applypatch`.

source: The next issue is your commit access.
cs: Další otázkou je vaše oprávnění k zapisování revizí.

source: The next line in your `print_export` file is
cs: Dalším řádkem v souboru `print_export` bude

source: The next line is 0000, meaning the server is done with its references listing.
cs: Následující řádek je 0000 – touto kombinací server označuje konec seznamu referencí.

source: The next line starts with 003e, which is 62, so you read the remaining 62 bytes.
cs: Další řádek začíná hodnotou 003e (tedy 62), což znamená dalších 62 bytů.

source: The next major issue that people encounter is that they need to collaborate with developers on other systems.
cs: Dalším velkým problémem, s nímž se uživatelé potýkají, je potřeba spolupráce s dalšími pracovníky týmu.

source: The next place Git looks is the `~/.gitconfig` file, which is specific to each user.
cs: Dalším místem, kde Git vyhledává, je soubor `~/.gitconfig`, který je specifický pro každého uživatele.

source: The next section deals with projects that prefer to accept contributed patches via e-mail.
cs: Další část se pak zabývá projekty, u nichž je upřednostňováno doručování záplat e-mailem.

source: The next sections will explain some typical setups using those protocols and how to get your server running with them.
cs: V dalších částech popíšeme některá typická nastavení pro použití těchto protokolů, a jak s nimi uvést server do provozu.

source: The next system you’ll look at importing from is Perforce.
cs: Dalším systémem, z nějž budeme importovat, bude Perforce.

source: The next thing you’ll notice is the error message.
cs: Další věcí, jíž si všimnete, je chybové hlášení.

source: The next time one of your collaborators fetches from the server, they will get a reference to where the server’s version of `serverfix` is under the remote branch `origin/serverfix`:
cs: Až bude příště některý z vašich spolupracovníků vyzvedávat data ze serveru, obdrží referenci o tom, kde se nachází serverová verze větve `serverfix` ve vzdálené větvi `origin/serverfix`:

source: The next time you check out this file, Git injects the SHA of the blob:
cs: Při příštím checkoutu tohoto souboru Git vloží SHA blobu:

source: The next time you commit, the file will be gone and no longer tracked.
cs: Po příštím zapsání revize soubor zmizí a přestane být sledován.

source: The next two fields are values extracted from that commit—the author name and the authored date of that commit — so you can easily see who modified that line and when.
cs: Další dvě pole jsou hodnoty získané z revize: jméno autora a datum, zapsané u této revize. Z toho vyčtete, kdo a kdy tento řádek upravil.

source: The next two sections demonstrate how to wrangle your staging area and working directory changes.
cs: Následující dvě části popisují, jak se poprat s oblastí připravených změn a se změnami v pracovním adresáři.

source: The next type you’ll look at is the tree object, which solves the problem of storing the filename and also allows you to store a group of files together.
cs: Dalším typem objektu, na který se podíváme, je objekt stromu (tree object), jenž řeší problém ukládání názvu souboru a zároveň umožňuje uložit skupinu souborů dohromady.

source: The next variable is the workflow in use for the project.
cs: Další proměnnou je pracovní postup, který se u projektu využívá.

source: The nice part is that the command you use to determine the state of those two areas also reminds you how to undo changes to them.
cs: Je příjemné, že příkaz, jímž se zjišťuje stav těchto dvou oblastí, zároveň připomíná, jak v nich nežádoucí změny zrušit.

source: The nice thing about this is that applying a patch from an e-mail generated with `format-patch` preserves all the commit information properly, as you’ll see more of in the next section when you apply these patches:
cs: Výhodou tohoto postupu je, že aplikace záplaty z e-mailu, který byl vygenerován příkazem `format-patch`, v pořádku uchová všechny informace o revizi. Podrobněji si to ukážeme v následující části, až budeme aplikovat tyto revize:

source: The nice thing about this wrapper setup is that you can change your diff and merge tools easily.
cs: Příjemné na tomto wrapperovém nastavení je, že lze snadno změnit nástroj diff i nástroj pro slučování.

source: The number of randomly hashed objects needed to ensure a 50% probability of a single collision is about 2^80 (the formula for determining collision probability is `p = (n(n-1)/2) * (1/2^160)`).
cs: Počet objektů s náhodným otiskem, které bychom potřebovali k 50% pravděpodobnosti, že nastane jediná kolize, je asi 2^80 (vzorec k určení pravděpodobnosti kolize je `p = (n(n-1)/2) * (1/2^160)`).

source: The objects that remain are the blobs that aren’t pointed to by any commit — in this case, the "what is up, doc?" example and the "test content" example blobs you created earlier.
cs: Objekty, které zůstaly, jsou bloby, na něž neukazuje žádná revize, v našem případě bloby z příkladů „what is up, doc?“ a „test content“, které jsme vytvořili před časem.
